<?php

return [
    400 => '錯誤的請求',
    401 => '未經授權',
    404 => '找不到',
    422 => '無法解析的請求',
    500 => '伺服器錯誤，請聯絡管理員',

    4295 => '註冊申請已送出，審核結果將以註冊信箱通知',
    4300 => '請輸入信箱',
    4305 => '帳號\n1. 只能包含：小寫英文、大寫英文、數字、 _、- 、＠\n2. 字元數量需4～50',
    4310 => '該帳號已重複註冊',
    4315 => 'source 來源有誤',
    4320 => '請輸入帳號(請輸入%s)',
    4325 => '請輸入密碼',
    4326 => '此帳號尚未開通（可能是您尚未註冊，或註冊後尚未通過審核，或審核後尚未經過驗證）',
    4328 => '您的帳戶已經過驗證',
    4329 => '該第三方未授權我們取得足夠的資料，您需再提供 Email',
    4330 => '請輸入確認密碼',

    4331 => '請檢查信箱格式',
    4332 => '該信箱已重複註冊',
    4333 => '請檢察前端的key值是否皆與後端相對應',
    4334 => '請輸入帳號或信箱',

    4335 => '請輸入姓名',
    4336 => '請輸入顯示名稱',
    4337 => '請輸入權限',
    4338 => '請輸入關鍵字',
    4340 => '請輸入公司名稱',
    4345 => '請輸入國家',
    4350 => '請輸入地址',
    4355 => '請輸入電話',
    4356 => '請輸入 access_token',
    4360 => '請輸入產業類別',
    4365 => '請輸入需要服務的項目',
    4370 => '兩次密碼輸入不一致←→',
    4375 => '已發送驗證信，請於五分鐘內至信箱查看',
    4380 => '請輸入從何得知全球傳動集團',
    4385 => '驗證碼輸入錯誤',
    4390 => '該驗證碼已過期',
    4395 => '註冊成功',
    4400 => '請重新設定密碼',
    4405 => '請重新設定密碼',
    4410 => '帳號或密碼有誤',
    4415 => '帳號或密碼有誤，還剩2次機會\n（注意：錯誤累積3次，帳號將被鎖住）',
    4420 => '帳號或密碼有誤，還剩1次機會\n（注意：錯誤累積3次，帳號將被鎖住）',
    4425 => '你的帳號已遭鎖，解鎖請洽客服人員',
    4430 => '確認已詳閱並同意隱私權政策',

    4440 => '請輸入 target_url 欄位',
    4445 => '請檢查 target_url 的格式',
    4450 => '您的帳號尚未經過驗證，請至信箱收取驗證信',
    4455 => 'Token 有誤，請聯絡管理員',
    4460 => 'Token 失效過期',
    4461 => '驗證按鈕已超過時效，請至登入頁重新發送驗證信，或聯絡管理員',
    4462 => '驗證按鈕過期或 Token 失效，請聯絡 iSB 管理員',
    4465 => '您的密碼不符合以下條件限制：\n1. 英文（有分大小寫）、數字自由組合\n2. 可包含以下特殊符號：（_）、（-）、（.）、（+ ）、（＠）\n3. 字元長度6～12位',
    4470 => '您的閒置時間過久，為確保您資料安全，系統已為您自動登出',
    4475 => '我們偵測到該帳號於其他裝置有登入活動，系統已為您自動登出',
    4480 => '該帳號尚未註冊',
    4485 => '未帶入 token 值',
    4490 => '產品不存在，無法處理此次請求',
    4491 => '此帳號已透過第三方登入註冊過，請重新註冊',
    4496 => '不支援此 provider',


    // Verification
    4500 => '加密驗證失敗',

    // User status error
    // 核准（尚未驗證）
    4505 => '您的帳戶尚未經過驗證，請前往信箱收取驗證信',
    // 停用
    4510 => '您的帳戶目前為停用狀態，請洽客服人員',
    // 鎖住
    4515 => '密碼輸入錯誤達3次，您的帳戶已暫時鎖住，請洽客服人員',
    // 暫停
    4520 => '您的帳戶目前為暫停狀態，請洽客服人員',
];
